---
kind: method
id: M:Autodesk.Revit.DB.ScheduleSortGroupField.#ctor
source: html/4a67eab6-6833-15df-89aa-a727605d2306.htm
---
# Autodesk.Revit.DB.ScheduleSortGroupField.#ctor Method

Creates a new ScheduleSortGroupField.

## Syntax (C#)
```csharp
public ScheduleSortGroupField()
```